const pros = [
    {
        head: "Виртуальная DOM",
        text: "React использует виртуальную DOM, что позволяет ему обновлять и рендерить только те компоненты, которые необходимо изменить, а не всю страницу. Это ускоряет процесс и делает приложения более эффективными.",
        icon: 'tree.png'
    },
    {
        head: "Независимость компонентов",
        text: 'React позволяет разработчикам создавать независимые, повторно используемые компоненты, что упрощает разработку и поддержку кода.',
        icon: 'block.png'
    },
    {
        head: "JSX",
        text: 'React использует JSX, что позволяет разработчикам писать HTML-подобный код в JavaScript, что упрощает создание компонентов и улучшает читаемость кода.',
        icon: 'code.png'
    },
    {
        head: "Однонаправленный поток данных",
        text: 'React использует однонаправленный поток данных, что упрощает отслеживание изменений и улучшает производительность приложения.',
        icon: 'arrow.png'
    },
    {
        head: "Огромное сообщество",
        text: 'React имеет огромное сообщество разработчиков, что упрощает поиск решений и помощь в разработке приложений.',
        icon: 'community.png'
    }
]
export default pros;
